Revit 2027 API
FailureMessage Constructor
 Creates a new FailureMessage related to a given FailureDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureMessage(
	FailureDefinitionId id
)
Public Sub New (
	id As FailureDefinitionId
)
public:
FailureMessage(
	FailureDefinitionId^ id
)
new :
        id : FailureDefinitionId -> FailureMessage
Parameters
id FailureDefinitionId
 Id of FailureDefinition.
Exceptions
Exception | Condition
ArgumentException |  id is invalid or does not have corresponding failure definition.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace